from pymongo import MongoClient
import json
from datetime import datetime

client = MongoClient("mongodb://jisu:%40ghdwltn1@59.6.7.229:27018")

db = client.book
collection = db.keyword

night_keywords = ['인생', '위로', '내면', '인간관계', '감정', '상처', '마음', '일상', '공감', '사람', '삶', '관계', '치유', '감성에세이', '대화', '외로움',
                  '고독', '우정', '미움', '삶의지혜', '아픔', '친구', '그리움', '심리', '추억', '철학자', '고민', '철학', '우울증', '사색', '사유', '힐링',
                  '생각', '일기', '감성', '감동', '어른을위한동화', '감성', '에세이', '글귀', '심리상담', '일기장', '풍자', '새벽', '휴식', '눈물', '심리치유',
                  '속', '마음', '격려', '다이어리', '인생', '수업', '마음치유', '마음속', '마음챙김', '마음', '공부', '불면증', '심리', '치료', '심리',
                  '치료사', '불면', '평온', '감사', '일기']
morning_keywords = ['자기관리', '자신', '커리어', '성공', '멘토', '스펙', '청춘', '자기혁신', '재테크', '성장', '성공법', '리더십', '용기', '리더', '조언',
                    '지혜', '처세', '명상', '인생처세술', '자기계발', '희망', '성장소설', '변화', '긍정', '인사이트', '소통', '자존감', '성공스토리', '성찰',
                    '성공학', '직장처세술', '성장', '소설', '멘탈', '청춘', '소설', '시간관리', '멘토링', '도전', '통찰', '노력', '실행력', '성공', '법칙',
                    '꿈', '목표', '달성', '젊음', '버킷', '리스트', '마인드컨트롤', '에너지', '성과', '창의성', '시간', '관리', '효능감', '진로', '실천',
                    '몰입', '웃음', '열정', '명언', '명상에세이', '집중', '집중력', '동기부여', '잠재력', '성숙', '자신감', '인생론', '존재감', '평안', '평화',
                    '업무력', '계획', '체력', '목표달성', '창의력', '자아존중감', '터닝', '포인트', '스트레칭', '성취', '시간', '관리법']

love_keywords = ['사랑', '행복', '시집', '연애', '로맨스', '이별', '로맨스소설', '연애소설', '편지', '연인', '운명', '사랑 이야기', '첫사랑', '커플', '인연', '애인', '한국로맨스소설', '봄밤', '짝사랑', '고백', '낭만', '연애편지', '남자 친구', '여자 친구', '떨림', '실연', '연애담', '남녀 관계', '남녀관계', '러브 스토리', '연애 세포', '프러포즈', '연애에세이', '청혼', '남녀', '연인 관계', '키스', '소개팅', '재밌는', '베스트셀러', '밀리언셀러', '노벨문학상', '퓰리처상', '노벨 문학상', '스테디셀러', '아마존 베스트셀러']


list = love_keywords.split('\n')
print(list)
# 2) 밤인지 낮인지 확인
# 낮이라면:
isbn_lst = list()
if 4 <= datetime.now().hour <= 16:
    keyword_book_isbn = collection.find({'keyword': {"$in": [morning_keywords]}})[0]['isbn13']
else:
    keyword_book_isbn = collection.find()
    for book in keyword_book_isbn:
        temp_dict = {}
        temp_keyword_lst = book['keyword']
        for keyword in temp_keyword_lst:
            if keyword in night_keywords:
                isbn_lst.append(book['isbn13'])


print(len(isbn_lst))

# 2개 이상 언급된거 위주로 추천하기
final_keyword_isbn_lst = list()
for isbn in isbn_lst:
    if isbn_lst.count(isbn) > 3:
        final_keyword_isbn_lst.append(isbn)

print(len(final_keyword_isbn_lst))


